
def area(a):
    '''
    Возвращает площадь квадрата с длиной стороны равной a.
    
        Параметры:
            a (int): целое число, длина стороны квадрата
        
        Возвращаемое значение:
            (int): целое число, площадь квадрата с длиной стороны равной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата с длиной стороны равной a.
    
        Параметры:
            a (int): целое число, длина стороны квадрата
        
        Возвращаемое значение:
            (int): целое число, периметр квадрата с длиной стороны равной a
    '''
    return 4 * a
